---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RasterSymbolViewname
source: html/eb96b5ff-9c44-f265-686f-7e89c6373bdd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RasterSymbolViewname Property

"View Name"

## Syntax (C#)
```csharp
public static ForgeTypeId RasterSymbolViewname { get; }
```